# Fitting Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..Fitting Property
GroupTypeId Class See Also
---
Fittings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId Fitting { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Fitting As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Fitting {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace